This is the output of my local run:

```bash
skatsaounis@skatsaounis-x1:~/projects/tf-playground$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # maas_device.test_create_device will be created
  + resource "maas_device" "test_create_device" {
      + description  = "Test description"
      + domain       = "maas"
      + fqdn         = (known after apply)
      + hostname     = "dummy device"
      + id           = (known after apply)
      + ip_addresses = (known after apply)
      + owner        = (known after apply)
      + zone         = (known after apply)

      + network_interfaces {
          + id          = (known after apply)
          + mac_address = "12:23:45:67:11:ab"
          + name        = (known after apply)
        }
      + network_interfaces {
          + id          = (known after apply)
          + mac_address = "12:23:45:67:11:de"
          + name        = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

maas_device.test_create_device: Creating...
maas_device.test_create_device: Creation complete after 1s [id=fas688]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
skatsaounis@skatsaounis-x1:~/projects/tf-playground$ terraform plan
maas_device.test_create_device: Refreshing state... [id=fas688]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```